/* automatically generated by rust-bindgen 0.72.1 */

pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CCaDiCaL {
    _unused: [u8; 0],
}
extern "C" {
    pub fn ccadical_signature() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn ccadical_init() -> *mut CCaDiCaL;
}
extern "C" {
    pub fn ccadical_release(arg1: *mut CCaDiCaL);
}
extern "C" {
    pub fn ccadical_val(arg1: *mut CCaDiCaL, lit: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_failed(
        arg1: *mut CCaDiCaL,
        lit: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_set_terminate(
        arg1: *mut CCaDiCaL,
        state: *mut ::std::os::raw::c_void,
        terminate: ::std::option::Option<
            unsafe extern "C" fn(state: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
        >,
    );
}
extern "C" {
    pub fn ccadical_set_learn(
        arg1: *mut CCaDiCaL,
        state: *mut ::std::os::raw::c_void,
        max_length: ::std::os::raw::c_int,
        learn: ::std::option::Option<
            unsafe extern "C" fn(
                state: *mut ::std::os::raw::c_void,
                clause: *mut ::std::os::raw::c_int,
            ),
        >,
    );
}
extern "C" {
    pub fn ccadical_constraint_failed(arg1: *mut CCaDiCaL) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_get_option(
        arg1: *mut CCaDiCaL,
        name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_print_statistics(arg1: *mut CCaDiCaL);
}
extern "C" {
    pub fn ccadical_active(arg1: *mut CCaDiCaL) -> i64;
}
extern "C" {
    pub fn ccadical_irredundant(arg1: *mut CCaDiCaL) -> i64;
}
extern "C" {
    pub fn ccadical_fixed(arg1: *mut CCaDiCaL, lit: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_terminate(arg1: *mut CCaDiCaL);
}
extern "C" {
    pub fn ccadical_freeze(arg1: *mut CCaDiCaL, lit: ::std::os::raw::c_int);
}
extern "C" {
    pub fn ccadical_frozen(
        arg1: *mut CCaDiCaL,
        lit: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_melt(arg1: *mut CCaDiCaL, lit: ::std::os::raw::c_int);
}
pub const OUT_OF_MEM: ::std::os::raw::c_int = 50;
extern "C" {
    pub fn ccadical_add_mem(
        wrapper: *mut CCaDiCaL,
        lit: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_assume_mem(
        wrapper: *mut CCaDiCaL,
        lit: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_constrain_mem(
        wrapper: *mut CCaDiCaL,
        lit: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_solve_mem(wrapper: *mut CCaDiCaL) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_configure(
        ptr: *mut CCaDiCaL,
        name: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_phase(ptr: *mut CCaDiCaL, lit: ::std::os::raw::c_int);
}
extern "C" {
    pub fn ccadical_unphase(ptr: *mut CCaDiCaL, lit: ::std::os::raw::c_int);
}
extern "C" {
    pub fn ccadical_vars(ptr: *mut CCaDiCaL) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_set_option_ret(
        wrapper: *mut CCaDiCaL,
        name: *const ::std::os::raw::c_char,
        val: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_limit_ret(
        wrapper: *mut CCaDiCaL,
        name: *const ::std::os::raw::c_char,
        val: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_redundant(wrapper: *mut CCaDiCaL) -> i64;
}
extern "C" {
    pub fn ccadical_simplify_rounds(
        wrapper: *mut CCaDiCaL,
        rounds: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_reserve(
        wrapper: *mut CCaDiCaL,
        min_max_var: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_propagations(wrapper: *mut CCaDiCaL) -> i64;
}
extern "C" {
    pub fn ccadical_decisions(wrapper: *mut CCaDiCaL) -> i64;
}
extern "C" {
    pub fn ccadical_conflicts(wrapper: *mut CCaDiCaL) -> i64;
}
extern "C" {
    pub fn ccadical_flip(
        wrapper: *mut CCaDiCaL,
        lit: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_flippable(
        wrapper: *mut CCaDiCaL,
        lit: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_propagate(wrapper: *mut CCaDiCaL) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ccadical_get_entrailed_literals(
        wrapper: *mut CCaDiCaL,
        entrailed_cb: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_int),
        >,
        cb_data: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn ccadical_trace_proof_path(
        wrapper: *mut CCaDiCaL,
        path: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CCaDiCaLTracer {
    _unused: [u8; 0],
}
pub const CCaDiCaLConclusionType_CONFLICT: CCaDiCaLConclusionType = 1;
pub const CCaDiCaLConclusionType_ASSUMPTIONS: CCaDiCaLConclusionType = 2;
pub const CCaDiCaLConclusionType_CONSTRAINT: CCaDiCaLConclusionType = 4;
pub type CCaDiCaLConclusionType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CCaDiCaLTraceCallbacks {
    pub add_original_clause: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: u64,
            arg3: bool,
            arg4: usize,
            arg5: *const ::std::os::raw::c_int,
            arg6: bool,
        ),
    >,
    pub add_derived_clause: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: u64,
            arg3: bool,
            arg4: usize,
            arg5: *const ::std::os::raw::c_int,
            arg6: usize,
            arg7: *const u64,
        ),
    >,
    pub delete_clause: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: u64,
            arg3: bool,
            arg4: usize,
            arg5: *const ::std::os::raw::c_int,
        ),
    >,
    pub weaken_minus: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: u64,
            arg3: usize,
            arg4: *const ::std::os::raw::c_int,
        ),
    >,
    pub strengthen:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: u64)>,
    pub report_status: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: ::std::os::raw::c_int,
            arg3: u64,
        ),
    >,
    pub finalize_clause: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: u64,
            arg3: usize,
            arg4: *const ::std::os::raw::c_int,
        ),
    >,
    pub begin_proof:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: u64)>,
    pub solve_query: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub add_assumption: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: ::std::os::raw::c_int),
    >,
    pub add_constraint: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: usize,
            arg3: *const ::std::os::raw::c_int,
        ),
    >,
    pub reset_assumptions:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub add_assumption_clause: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: u64,
            arg3: usize,
            arg4: *const ::std::os::raw::c_int,
            arg5: usize,
            arg6: *const u64,
        ),
    >,
    pub conclude_unsat: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: CCaDiCaLConclusionType,
            arg3: usize,
            arg4: *const u64,
        ),
    >,
    pub conclude_sat: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut ::std::os::raw::c_void,
            arg2: usize,
            arg3: *const ::std::os::raw::c_int,
        ),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CCaDiCaLTraceCallbacks"][::std::mem::size_of::<CCaDiCaLTraceCallbacks>() - 120usize];
    ["Alignment of CCaDiCaLTraceCallbacks"]
        [::std::mem::align_of::<CCaDiCaLTraceCallbacks>() - 8usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::add_original_clause"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, add_original_clause) - 0usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::add_derived_clause"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, add_derived_clause) - 8usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::delete_clause"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, delete_clause) - 16usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::weaken_minus"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, weaken_minus) - 24usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::strengthen"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, strengthen) - 32usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::report_status"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, report_status) - 40usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::finalize_clause"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, finalize_clause) - 48usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::begin_proof"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, begin_proof) - 56usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::solve_query"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, solve_query) - 64usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::add_assumption"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, add_assumption) - 72usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::add_constraint"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, add_constraint) - 80usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::reset_assumptions"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, reset_assumptions) - 88usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::add_assumption_clause"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, add_assumption_clause) - 96usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::conclude_unsat"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, conclude_unsat) - 104usize];
    ["Offset of field: CCaDiCaLTraceCallbacks::conclude_sat"]
        [::std::mem::offset_of!(CCaDiCaLTraceCallbacks, conclude_sat) - 112usize];
};
extern "C" {
    pub fn ccadical_connect_proof_tracer(
        arg1: *mut CCaDiCaL,
        arg2: *mut ::std::os::raw::c_void,
        arg3: CCaDiCaLTraceCallbacks,
        arg4: bool,
    ) -> *mut CCaDiCaLTracer;
}
extern "C" {
    pub fn ccadical_disconnect_proof_tracer(arg1: *mut CCaDiCaL, arg2: *mut CCaDiCaLTracer)
        -> bool;
}
